package common

import (
	"math/rand"
	"time"
)

func GenerateChinese() string {
	a := make([]rune, 100)
	for i := range a {
		a[i] = rune(RandInt(19968, 40869))
	}
	return string(a)
}

func RandInt(min, max int64) int64 {
	rand.Seed(time.Now().UnixNano())
	return min + rand.Int63n(max-min)
}

func GenerateName() string {
	firstName := []string{
		"李", "王", "张", "刘", "陈", "杨", "黄", "赵", "周", "吴", "徐", "孙", "朱", "马", "胡", "郭", "林", "何", "高", "梁",
		"郑", "罗", "宋", "谢", "唐", "韩", "曹", "许", "邓", "萧", "冯", "曾", "程", "蔡", "彭", "潘", "袁", "于", "董", "余",
		"苏", "叶", "吕", "魏", "蒋", "田", "杜", "丁", "沈", "姜", "范", "江", "傅", "钟", "卢", "汪", "戴", "崔", "任", "陆",
		"廖", "姚", "方", "金", "邱", "夏", "谭", "韦", "贾", "邹", "石", "熊", "孟", "秦", "阎", "薛", "侯", "雷", "白", "龙",
		"殷", "郝", "孔", "邵", "史", "毛", "常", "万", "顾", "赖", "武", "康", "贺", "严", "尹", "钱", "施", "牛", "洪", "龚",
	}
	lastName := []string{
		"建国", "建华", "国华", "和平", "明", "建平", "军", "平", "志明", "徳明", "秀英", "桂英", "秀兰", "玉兰", "桂兰", "秀珍",
		"凤英", "玉珍", "玉英", "兰英", "军", "勇", "伟", "建国", "建华", "建军", "平", "建平", "强", "斌", "秀英", "桂英", "英",
		"玉兰", "萍", "秀兰", "玉梅", "红", "丽", "敏", "勇", "军", "伟", "强", "刚", "建军", "涛", "斌", "波", "辉", "丽", "艳",
		"敏", "芳", "静", "霞", "红梅", "燕", "红", "英", "伟", "磊", "勇", "涛", "超", "强", "鹏", "军", "波", "杰", "静", "丽",
		"娟", "艳", "燕", "敏", "娜", "芳", "丹", "玲", "伟", "超", "涛", "杰", "鹏", "磊", "强", "浩", "鑫", "帅 静", "婷", "敏",
		"雪", "丽", "倩", "艳", "娟", "涛", "浩", "杰", "鑫", "俊杰", "磊", "帅", "宇", "浩然", "鹏", "婷", "欣怡", "婷婷", "静",
		"悦", "敏", "佳怡", "雪", "颖", "雨欣", "浩宇", "浩然", "宇轩", "子轩", "宇航", "皓轩", "子豪", "浩轩", "俊杰", "子涵",
		"欣怡", "梓涵", "诗涵", "梓宣", "子涵", "紫涵", "佳怡", "雨涵", "雨欣", "一诺", "婷婷", "丹",
	}
	return firstName[getRandIndex(len(firstName)-1)] + lastName[getRandIndex(len(lastName)-1)]
}

func getRandIndex(maxNum int) int {
	rand.Seed(time.Now().UnixNano())
	return rand.Intn(maxNum)
}
